In [20]:
import pandas as pd
from sklearn.pipeline import Pipeline

In [2]:
from pandasql import sqldf

In [3]:
data = {'Name':['Alice','Bob','Charlie','David', 'Ram','Ganesh', 'Imran', 'Irfan'],
       'Age': [23,43,43,65,32,11,14,56]}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

      Name  Age
0    Alice   23
1      Bob   43
2  Charlie   43
3    David   65
4      Ram   32
5   Ganesh   11
6    Imran   14
7    Irfan   56

In [7]:
df[df['Age']<30]

     Name  Age
0   Alice   23
5  Ganesh   11
6   Imran   14

In [16]:
query = 'select Name, Age from df where Age<30'
query = 'select Name, Age from df where Name like "I%"'

In [18]:
res =sqldf(query)

In [19]:
res

    Name  Age
0  Imran   14
1  Irfan   56

In [22]:
df

      Name  Age
0    Alice   23
1      Bob   43
2  Charlie   43
3    David   65
4      Ram   32
5   Ganesh   11
6    Imran   14
7    Irfan   56